class PetBreeds {
  static const Map<String, List<String>> dogBreeds = {
    '소형견': [
      '말티즈', '포메라니안', '치와와', '요크셔테리어', '시추',
      '푸들(토이)', '비숑프리제', '파피용', '닥스훈트', '퍼그',
      '프렌치불독', '보스턴테리어', '페키니즈', '스피츠', '이탈리안그레이하운드',
    ],
    '중형견': [
      '비글', '코커스패니얼', '샤페이', '불독', '바센지',
      '웰시코기', '시바이누', '차우차우', '달마시안', '스프링거스패니얼',
    ],
    '대형견': [
      '골든리트리버', '래브라도리트리버', '저먼셰퍼드', '허스키', '말라뮤트',
      '버니즈마운틴독', '그레이트데인', '도베르만', '로트와일러', '보더콜리',
    ],
    '믹스/기타': [
      '믹스견', '기타',
    ],
  };

  static const Map<String, List<String>> catBreeds = {
    '단묘종': [
      '브리티시숏헤어', '아메리칸숏헤어', '스코티시폴드', '러시안블루', '아비시니안',
      '벵갈', '봄베이', '이집션마우', '코랫', '버미즈',
    ],
    '장묘종': [
      '페르시안', '메인쿤', '노르웨이숲', '시베리안', '라가머핀',
      '버만', '바리니즈', '터키시앙고라', '소말리', '히말라얀',
    ],
    '특수종': [
      '먼치킨', '렉스', '스핑크스', '오시캣', '픽시밥',
    ],
    '믹스/기타': [
      '코리안숏헤어', '믹스묘', '기타',
    ],
  };
}